In [28]:
import pandas as pd
from sqlalchemy import create_engine
import pandas as pd
import mysql.connector
import pandas as pd
from sqlalchemy import create_engine

In [2]:
pip install pandas mysql-connector-python openpyxl

Requirement already satisfied: pandas in c:\users\pravin\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: mysql-connector-python in c:\users\pravin\anaconda3\lib\site-packages (9.1.0)
Requirement already satisfied: openpyxl in c:\users\pravin\anaconda3\lib\site-packages (3.1.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\pravin\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pravin\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\pravin\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\pravin\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: et-xmlfile in c:\users\pravin\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\pravin\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\pravin\anaconda3\lib\site-packages (9.1.0)
Note: you may need to restart the kernel to use updated packages.

In [30]:
excel_file = 'Data for ETL Assignment.xlsx'

In [32]:
df_customer = pd.read_excel(excel_file, sheet_name='Customers')
df_products = pd.read_excel(excel_file, sheet_name='Products')
df_orders = pd.read_excel(excel_file, sheet_name='Orders')
df_payments = pd.read_excel(excel_file, sheet_name='Payments')

In [34]:
username = 'root'              
password = 'pravinSTR%402917' 
host = '127.0.0.1'
database = 'ecommerce_db'

In [36]:
connection_string = f'mysql+pymysql://{username}:{password}@{host}/{database}'

In [38]:
engine = create_engine(connection_string)

In [40]:
df_customer.head(1)

,customer_id,first_name,last_name,email,phone_number,created_at
0,1,Regina,Banks,kjones@petty.biz,374.831.2327x000,2022-11-20 19:15:32

In [42]:
df_customer.isnull().sum()

customer_id     0
first_name      0
last_name       0
email           0
phone_number    0
created_at      0
dtype: int64

In [44]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   100 non-null    int64
 1   first_name    100 non-null    object
 2   last_name     100 non-null    object
 3   email         100 non-null    object
 4   phone_number  100 non-null    object
 5   created_at    100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(4)
memory usage: 4.8+ KB

In [46]:
df_customer['phone_number'] = pd.to_numeric(df_customer['phone_number'], errors='coerce')

In [48]:
df_products.head(1)

,product_id,product_name,category,price,stock_quantity,created_at
0,1,Money Wear,Toys,234.12,238,2023-08-23 13:17:46

In [50]:
df_products.isnull().sum()

product_id        0
product_name      0
category          0
price             0
stock_quantity    0
created_at        0
dtype: int64

In [52]:
df_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   product_id      100 non-null    int64
 1   product_name    100 non-null    object
 2   category        100 non-null    object
 3   price           100 non-null    float64
 4   stock_quantity  100 non-null    int64
 5   created_at      100 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 4.8+ KB

In [54]:
df_orders.head(1)

   order_id  customer_id          order_date  total_amount     status
0         1           82 2024-01-17 19:11:33        163.94  Delivered

In [57]:
df_orders.isnull().sum()

order_id        0
customer_id     0
order_date      0
total_amount    0
status          0
dtype: int64

In [60]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   order_id      200 non-null    int64
 1   customer_id   200 non-null    int64
 2   order_date    200 non-null    datetime64[ns]
 3   total_amount  200 non-null    float64
 4   status        200 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 7.9+ KB

In [62]:
df_payments.head(1)

,payment_id,order_id,payment_method,payment_status,payment_date,amount_paid
0,1,197,PayPal,Completed,2021-08-07 05:44:03,627.38

In [65]:
df_payments.isnull().sum()

payment_id        0
order_id          0
payment_method    0
payment_status    0
payment_date      0
amount_paid       0
dtype: int64

In [68]:
df_payments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   payment_id      200 non-null    int64
 1   order_id        200 non-null    int64
 2   payment_method  200 non-null    object
 3   payment_status  200 non-null    object
 4   payment_date    200 non-null    datetime64[ns]
 5   amount_paid     200 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 9.5+ KB

In [72]:
df_customer.to_sql('Customers', con=engine, if_exists='replace', index=False)
df_products.to_sql('Products', con=engine, if_exists='replace', index=False)
df_orders.to_sql('Orders', con=engine, if_exists='replace', index=False)
df_payments.to_sql('Payments', con=engine, if_exists='replace', index=False)

C:\Users\Pravin\AppData\Local\Temp\ipykernel_2252\3459960222.py:1: UserWarning: The provided table name 'Customers' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_customer.to_sql('Customers', con=engine, if_exists='replace', index=False)
C:\Users\Pravin\AppData\Local\Temp\ipykernel_2252\3459960222.py:2: UserWarning: The provided table name 'Products' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_products.to_sql('Products', con=engine, if_exists='replace', index=False)
C:\Users\Pravin\AppData\Local\Temp\ipykernel_2252\3459960222.py:3: UserWarning: The provided table name 'Orders' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_orders.to_sql('Orders', con=engine, if_exists='replace', index=False)
C:\Users\Pravin\AppData\Local\Temp\ipykernel_2252\3459960222.py:4: UserWarning: The provided table name 'Payments' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df_payments.to_sql('Payments', con=engine, if_exists='replace', index=False)

200

#  Basic Queries

#### 1 .Retrieve all customer details.

In [74]:
a1 = """ select * from customers """

In [78]:
pd.read_sql(a1,engine).head(1)

,customer_id,first_name,last_name,email,phone_number,created_date,created_time
0,1,Regina,Banks,kjones@petty.biz,NaN,2022-11-20,0 days 19:15:32

#### List all orders with their total amount and status.

In [91]:
a2 = """select order_id , Status  , sum(total_amount) as  Total from orders group by 1,2;"""

In [309]:
pd.read_sql(a2 , engine).head()

   order_id     Status   Total
0         1  Delivered  163.94
1         2    Shipped  334.71
2         3  Cancelled  674.77
3         4  Delivered  995.61
4         5    Shipped  747.65

#### Find all products that belong to the ‘Electronics’ category.

In [315]:
a3 = """select * from products where category = Electronics ;"""

In [317]:
pd.read_sql(a3 , engine)

OperationalError: (pymysql.err.OperationalError) (1054, "Unknown column 'Electronics' in 'where clause'")
[SQL: select * from products where category = Electronics ;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

# Intermediate Queries (Joins & Aggregations)

#### Find the total number of orders placed by each customer (customer_id and count).

In [149]:
a4 = "select c.customer_id , count(*) as Number_of_orders from orders as c  group by 1;"

In [153]:
pd.read_sql(a4 , engine).head(5)

   customer_id  Number_of_orders
0           82                 2
1           10                 4
2           74                 3
3           22                 5
4           19                 1

####  Retrieve a list of all orders, including customer names and order status.

In [165]:
a5 = """select concat(c.first_name,"-", c.last_name) as Full_name , o.order_id , o.status 
from customers as c
right join orders as o
on c.customer_id = o.customer_id ;"""

In [169]:
pd.read_sql(a5 , engine).head()

        Full_name  order_id     status
0   Thomas-Steele         1  Delivered
1     Carla-Young         2    Shipped
2     Shawn-Brown         3  Cancelled
3      Tammy-Byrd         4  Delivered
4  Robert-Gardner         5    Shipped

####  Find the total revenue (sum of all orders) generated.

In [172]:
a6 = """select sum(total_amount) as total_amount from orders;"""

In [176]:
pd.read_sql(a6, engine)

   total_amount
0      99055.83

####  Identify customers who have placed more than 3 orders.

In [188]:
a7 = """select concat( c.first_name ,"-", last_name ) as Full_name , count(o.order_id) as no_of_orders
from customers as c
join orders as o
on c.customer_id = o.customer_id
group by c.customer_id , full_name
having no_of_orders > 3;"""

In [196]:
pd.read_sql(a7 , engine).head()

          Full_name  no_of_orders
0       Carla-Young             4
1        Tammy-Byrd             5
2  Stephanie-Chavez             4
3    Melissa-Murray             4
4     Amanda-Carney             4

#### Retrieve all completed payments and include the associated order details.

In [199]:
a8 = """select concat(c.first_name , "-" , c.last_name) as full_name , o.order_id , o.orderr_date ,o.total_amount
from customers as c 
join orders as o
on c.customer_id = o.Customer_id
join payments as p
on o.order_id = p.order_id 
where p.payment_status = "completed";"""

In [203]:
pd.read_sql(a8,engine).head()

         full_name  order_id orderr_date  total_amount
0        Mark-Pena        43  2020-09-11        154.51
1      Brandon-Lee        19  2022-12-30        513.01
2  Theresa-Ramirez       107  2020-04-06        595.18
3    Kirsten-Duran       195  2020-12-13        981.00
4      Carla-Young       178  2020-05-15        693.80

# Advanced Queries

#### Find the top 5 customers who have spent the most on orders.

In [219]:
a9 = """select customer_id , total_amount from(
 select *,
 rank() over(order by total_amount desc ) as rnkkk
 from orders) as x 
 where rnkkk <= 5 ;"""

In [221]:
pd.read_sql(a9, engine).head()

   customer_id  total_amount
0           22        995.61
1           38        994.66
2           66        993.50
3           85        991.92
4           38        990.86

### List all orders where the payment was either ‘Pending’ or ‘Failed’

In [225]:
a10 = """select * from orders
 where order_id in (select order_id from payments where payment_method in ('Pending' , 'Failed'));"""

In [227]:
pd.read_sql(a10,engine)

Empty DataFrame
Columns: [order_id, customer_id, total_amount, status, orderr_date, order_time]
Index: []

#### Find the most popular product category based on the number of orders.

In [244]:
a11 = """select p.category , count(o.order_id)  as number_of_orders
from products as p
join orders as o
on p.product_id = o.product_id
group by 1
order by number_of_orders desc
limit 1;"""

In [246]:
pd.read_sql(a11 , engine)

   category  number_of_orders
0  Clothing                21

#### Identify orders that were placed but have no successful payment recorded.

In [262]:
a12 = """select * from orders
where order_id not in (select order_id from payments where payment_Status = "completed");"""

In [266]:
pd.read_sql(a12,engine).head()

,order_id,customer_id,total_amount,status,orderr_date,order_time,product_id
0,1,82,163.94,Delivered,2024-01-17,0 days 19:11:33,132
1,3,74,674.77,Cancelled,2020-05-20,0 days 20:11:19,63
2,5,19,747.65,Shipped,2022-09-01,0 days 10:24:57,198
3,9,71,853.37,Delivered,2020-01-09,0 days 12:32:08,116
4,10,4,103.04,Pending,2023-06-23,0 days 12:51:02,59

#### Calculate the average order value (AOV) per customer.

In [269]:
a13 = """select customer_id , avg(total_amount) as Avg_amount
from orders
group by 1;"""

In [275]:
pd.read_sql(a13,engine).head()

   customer_id  Avg_amount
0           82  192.415000
1           10  639.417500
2           74  576.756667
3           22  664.638000
4           19  747.650000

# Business-Oriented Analytical Questions

#### Identify which payment method is most commonly used.

In [290]:
ax = """select payment_method , count(*) as no_of_times
from payments
group by 1
order by no_of_times desc
limit 1;"""

In [292]:
pd.read_sql(ax,engine).head()

     payment_method  no_of_times
0  Cash On Delivery           48

#### Determine the percentage of orders that were canceled.

In [295]:
ay = """
select count(order_id) / (Select count(order_id) from orders) *  100 as Cancelled_Percentage
from orders
where status = "Cancelled";"""

In [297]:
pd.read_sql(ay , engine)

   Cancelled_Percentage
0                  22.0

#### Find out the month in which the most orders were placed.

In [305]:
az = """select monthname(orderr_date)  as monthss, count(*) as No_of_orders from orders
group by monthss
order by No_of_orders desc
limit 1;"""

In [307]:
pd.read_sql(az , engine).head()

   monthss  No_of_orders
0  January            22